# AssetPropertyDoubleArray2d Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDoubleArray2d Class
Members See Also
---
Represents a property consisting of an array of double values.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AssetPropertyDoubleArray2d : AssetProperty
```

Visual Basic
---
```text
Public Class AssetPropertyDoubleArray2d _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetPropertyDoubleArray2d : public AssetProperty
```

# Remarks
In virtually all cases, the array will contain exactly 2 values.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetPropertyDoubleArray2d
# See Also
AssetPropertyDoubleArray2d Members
Autodesk.Revit.DB.Visual Namespace